# FabricationItemFile Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FabricationItemFile Properties
FabricationItemFile Class See Also
---
The FabricationItemFile type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Identifier | The string identifier for the item file. This string is unique and can be used to compare whether fabrication item files are the same file. |
| IsUsed | Checks to see if the item file is already in use in the project. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
FabricationItemFile Class
Autodesk.Revit.DB Namespace